#+title: Lecture Notes
#+startup: show3levels
*** Singly Linked
| 0 | -> | 1 | -> | 2 | -> | 3 | -> | ... |
#+begin_src cpp
class IntSLLNode {
public:
        IntSSLNode() {
                next = 0;
        }
        IntSLLNode(int i, IntSLLNode *in = 0) {
                info = i;
                next = in;
        }
        int getInfo() {
            return info;
        }
private:
        int info;
        IntSLLNode *next;
};

int main () {
    IntSLLNode head(99);
    std::cout << head->getInfo() << std::endl;
    return 0;
}
#+end_src
#+RESULTS:
:results:
:end:
